import { EpisodeIdEnum } from './episodes.types';

export const secondEpisodeBasicInfo = {
  id: '2',
  title: 'Episode #2 - Web ის ევოლუცია, Toptal, ენთუზიაზმი, Job Market',
  description: 'ჩვენი ტექ პოდკასტის მეორე ეპიზოდი.',
  date: '2024-10-23',
  duration: 57,
  tags: ['ვებ დეველოპმენტი', 'ტოპტალი', 'ენთუზიაზმი', 'სამსახურები'],
  slug: EpisodeIdEnum.WEB_EVOLUTION_TOPTAL_ENTUZI_JOB_MARKET,
  youtubeId: 'bqmyM99JMHU',
  guest: 'Levan Lotuashvili',
};

export const secondEpisodeData = {
  ...secondEpisodeBasicInfo,
  fullDescription: `ჩვენი ტექ პოდკასტის მეორე ეპიზოდში, სტუმრად გვყავს ლევან ლოთუაშვილი. ამ ეპიზოდში განვიხილავთ ვებ დეველოპმენტის ევოლუციას ბოლო ათწლეულების განმავლობაში — სად დავიწყეთ და როგორ მოვედით დღევანდელ ეტაპამდე. 

ვისაუბრებთ ისეთ პლატფორმაზე, როგორიცაა Toptal: რა დადებითი და უარყოფითი მხარეები აქვს ამ ტიპის სამუშაო ბაზარს და როგორ შეიძლება ის დაეხმაროს ან აღმოჩნდეს ხელის შემშლელი  ინჟინრებისთვის.

განვიხილავთ ენთუზიაზმის მნიშვნელობას კარიერული განვითარებისას — როგორ შეიძლება გახდეს ეს ძლიერი იარაღი პროფესიონალად ჩამოყალიბებაში და როდის შეიძლება იყოს დამაბრკოლებელი. ასევე, გავაანალიზებთ რა მდგომარეობაშია დღეს ქართული ტექ ბაზარი, რა გამოწვევები და პრობლემები დგას ჩვენს წინაშე. დავაკვალიანებთ დამწყებებს, თუ როგორ გაზარდონ მათი შანსები, რათა წარმატებით დაიწყონ პირველი სამსახური.`,
};
