import { Episode, EpisodeBasicInfo } from './episodes.types';

export const twentyFourthEpisodeBasicInfo: EpisodeBasicInfo = {
  id: '-2fy_GHb_ag',
  title: 'Devtherapy #24 – Giorgi Mamaladze | საბჭოთა საქართველო, Siemens, Huawei, აზიური კულტურა, Early LLM',
  description:
    '🚀 Devtherapy-ის 24-ე ეპიზოდში გვეწვია სტუმარი, რომლის მოწვევაც პირველივე ეპიზოდიდან გვსურდა. ამისთვის დაგვჭირდა 23 ეპიზოდი, მაგრამ როგორც იქნა ეს შეხვედრა შედგა.',
  date: '2025-09-17T14:02:09Z',
  duration: 158,
  tags: [
    'java',
    'devops',
    'architecture',
    'ai',
    'early llm',
    'software architecture',
    'software design',
    'agile manifesto',
    'siemens',
    'huawei',
    'cloud',
    'microservices',
    '.net',
    'c++',
    'event sourcing',
    'tbc bank',
    'germany',
    'china',
    'ddd',
    'domain driven design',
  ],
  slug: 'giorgi-mamaladze',
  youtubeId: '-2fy_GHb_ag',
};

export const twentyFourthEpisodeData: Episode = {
  ...twentyFourthEpisodeBasicInfo,
  fullDescription: `🚀 Devtherapy-ის 24-ე ეპიზოდში გვეწვია სტუმარი, რომლის მოწვევაც პირველივე ეპიზოდიდან გვსურდა. ამისთვის დაგვჭირდა 23 ეპიზოდი, მაგრამ როგორც იქნა ეს შეხვედრა შედგა.

გიორგიმ გვიამბო თუ როგორ გაიარა გზა საბჭოთა საქართველოდან გერმანიამდე. როგორ გამოიყურებოდა საბჭოთა საქართველო ტექნიკურ ჭრილში და როგორ გახდა ის TBC ბანკის 21-ე თანამშრომელი.

პოდკასტის ამ ეპიზოდში გიორგი საუბრობს ისეთ საკითხებზე, როგორიცაა : Software Architecture, Software Design, Agile Manifesto, Siemens, Cloud, Huawei, აზიურ სამუშაო კულტურაზე და მრავალ სხვა საინტერესო საკითხზე. ამიტომ მოამზადეთ სნექები და დასხედით, ძალიან საინტერესო 2 საათ-ნახევარი გელოდებათ წინ ❤️

ერთ-ერთი გამორჩეული და საუკეთესო ეპიზოდი, მადლობა გიორგი! 

გვსურს შეგახსენოთ, რომ ჩვენი პარტნიორია DataFest o, https://www.datafest.ge/
რომელიც გაიმართება თბილისში 27-29 ნოემბერს. უახლოეს მომავალში ჩვენს არხზე გამოქვეყნდება სპეციალური პრომო კოდები, რომლითაც Devtherapy-ს ქომუნითის წევრებს ექნებათ შესაძლებლობა ისარგებლონ ფასდაკლებით.

გიორგის Github: 
https://github.com/gmamaladze

გიორგის Blog ი:
https://gmamaladze.medium.com/

გიორგის ჩატარებული Tech Talk-ები:

Scalable design - https://www.youtube.com/watch?v=kVlsn-lNz5A
პროგრამისტის 5 ეტაპი - https://www.youtube.com/watch?v=GFim38_ycVE
გადარჩი და გაიზარდე - https://www.youtube.com/watch?v=HLpeU5VrSX8
რატომ აღარაა საკმარისი იყო მხოლოდ კარგი პროგრამისტი - https://www.youtube.com/watch?v=ardQqMezzxc
Test Driven Development & Pair Programming - https://www.youtube.com/watch?v=yGg97JeyxWE
Just another tool in your toolbox - https://www.youtube.com/watch?v=UG97VgI5TyI
როგორ ამარტივებს DevOps ინჟინრის ცხოვრებას Event Sourcing - https://www.youtube.com/watch?v=qEyupL3hQ4U
AI & Robots - Technology, State, Individual - https://www.youtube.com/watch?v=tZNleeuNvDg
Human Machine Interface - past, present, future - https://www.youtube.com/watch?v=kh-m3w4kIB8

ეპიზოდში ნახსენები რესურსები: 

The Unreasonable Effectiveness of Recurrent Neural Networks - https://karpathy.github.io/2015/05/21/rnn-effectiveness/

Space Odyssey - https://letterboxd.com/film/2001-a-space-odyssey/

Domain-Driven Design - https://www.amazon.com/Domain-Driven-Design-Tackling-Complexity-Software/dp/0321125215

Kent Beck Agents, AI - https://www.youtube.com/watch?v=aSXaxOdVtAQ

Kent Beck - Tidy First? - https://www.amazon.com/Tidy-First-Kent-Beck-ebook/dp/B0CL7ZMLWH

The Big Picture: On the origins of Life, Meaning and the Universe itself https://www.amazon.com/Big-Picture-Origins-Meaning-Universe/dp/1101984252

მერვე სიცოცხლე (ბრილკას) - https://saba.com.ge/books/details/15425

🙏 შეგახსენებთ, რომ ჩვენი სპონსორია Techzy : https://www.techzy.app/

💬 შემოგვიერთდით ჩვენს Discord სერვერზე, უკვე 850+ ვართ 🚀
https://discord.com/invite/devtherapy

🎧 მოუსმინე და გამოიწერე ჩვენი პოდკასტი, შენს საყვარელ პლატფორმაზე 🎉
Buzzsprout 🎤 - https://tinyurl.com/devtherapy-buzzsrpout
AppleMusic 🎤 - https://tinyurl.com/devtherapy-applemusic
Spotify 🎤 - https://tinyurl.com/devtherapy-spotify
AmazonMusic 🎤 - https://tinyurl.com/devtherapy-amazon
Pocketcast 🎤 - https://tinyurl.com/devtherapy-pocketcast
Deezer 🎤 - https://tinyurl.com/devtherapy-deezer

📱 გვიპოვეთ სოც.ქსელებში:
Facebook: https://www.facebook.com/devtherapy
Instagram: https://www.instagram.com/_devtherapy/
TikTok: https://www.tiktok.com/@devtherapy.podcast
Linkedin: https://www.linkedin.com/company/devtherapy

https://www.linkedin.com/in/tornikegomareli/
https://www.linkedin.com/in/avtuney/

X: https://x.com/tornikegomareli
https://x.com/AVTUNEY_

Github: https://github.com/tornikegomareli

0:00 – 3:25 შესავალი
3:26 – 7:56 ბავშვობა, BASIC და კალკულატორები
7:57 – 13:17 სკოლა: CP-M, 90-იანები
13:18 – 23:09 საქსტატი: ინფლაცია, Windows 95
23:10 – 35:26 TBC ბანკი: IT ნოლიდან, ATM-ები
35:27 – 44:00 ინტეგრაციები → გერმანიაში სტარტაპი
44:01 – 55:24 ვაუჩერები, workflow, C++/Java/.NET
55:02 – 1:03:00 .NET, Interop, Windows CE,
1:03:01 – 1:16:22 Siemens, არქიტექტურული პატერნები, Agile/XP
1:16:23 – 1:36:13 Cloud და მიკროსერვისები; Huawei Shenzhen კულტურა
1:36:14 – 1:47:31 „უკან დაბრუნება": ლექციები, მენთორინგი
1:47:37 – 1:51:59 თავისუფალი უნივერსიტეტი და კონსალტინგი; SynoTec IoT
1:52:00 – 2:01:23 5 ეტაპი, AI გამოცდილებები
2:04:10 – 2:11:31 ჯუნიორები და AI: მოთხოვნის ფორმულირება, კოდის კითხვა
2:17:59 – 2:24:57 პესიმისტური vs ოპტიმისტური სცენარი; HAL 9000
2:25:04 – 2:30:31 რჩევები: კოდის კითხვა, ინგლისური, ალგორითმები, DDD
2:31:04 – 2:37:28 რეკომენდაციები: Kent Beck, The Big Picture, მერვე ცხოვრება`,
  quizzes: [],
};
