import { Episode, EpisodeBasicInfo } from './episodes.types';

export const twentySixthEpisodeBasicInfo: EpisodeBasicInfo = {
  id: 'sSqX34gsG2Y',
  title: 'Devtherapy #26 – Nika Nikabadze | DevOps Journey, Kubernetes, IaC, FinOps & Work-Life Balance',
  description:
    '🚀 Devtherapy-ს 26-ე ეპიზოდში ჩვენი სტუმარია ნიკა ნიქაბაძე. ნიკას აქვს ძალიან დიდი გამოცდილება დეველოპმენტში, DevOps, მენეჯერულ ნაწილში. \n\nდღევანდელ ეპიზოდში ბევრი ვისაუბრეთ საწყის ნაბიჯებზე, ქლაუდზე, Kubernetes-ზე, ცხოვრებასთან ბალანსზე, HR და Hiring კულტურაზე. დიდი მადლობა ნიკას სტუმრობისთვის.',
  date: '2025-10-25T11:09:56Z',
  duration: 132,
  tags: ['devops', 'kubernetes', 'aws', 'azure', 'ci/cd', 'monitoring'],
  slug: 'nika-nikabadze',
  youtubeId: 'sSqX34gsG2Y',
  guest: '',
};

export const twentySixthEpisodeData: Episode = {
  ...twentySixthEpisodeBasicInfo,
  fullDescription: `🚀 Devtherapy-ს 26-ე ეპიზოდში ჩვენი სტუმარია ნიკა ნიქაბაძე. ნიკას აქვს ძალიან დიდი გამოცდილება დეველოპმენტში, DevOps, მენეჯერულ ნაწილში. 

დღევანდელ ეპიზოდში ბევრი ვისაუბრეთ საწყის ნაბიჯებზე, ქლაუდზე, Kubernetes-ზე, ცხოვრებასთან ბალანსზე, HR და Hiring კულტურაზე. დიდი მადლობა ნიკას სტუმრობისთვის.

ჩვენი სპონსორია 

- A Serious Company! https://www.aseriouscompany.com/

კარიერა არ უნდა იყოს შემთხვევითობაზე დაფუძნებული. კურსი გასწავლით, როგორ შექმნათ სისტემა, რომლის გამოყენებითაც:

- ნებისმიერ გუნდში მიიღებთ აღიარებას
- დაინახავენ თქვენს პოტენციალს
- გარდაიქმნებით ლიდერად
- რაც მთავარია - შეძლებთ მარტივად იპოვოთ სამსახური ამერიკის ბაზარზე
- კურსი უკვე დაეხმარა 30-ზე მეტ ინჟინერს, რომელთაც პირველივე თვეს იშოვეს დამატებითი Tech სამსახური და შემოსავალი 50%-დან 200%-მდე გაეზარდათ.

მეტი ინფორმაციისთვის ეწვიეთ: https://www.aseriouscompany.com/

კურსის დეტალები:

- 9 ლექცია - ორშაბათი და ხუთშაბათი, 21:00 საათზე. თითოეული ლექცია 2-2.5 საათია
- ყველა ლექციის ჩანაწერი ხელმისაწვდომია შემდგომი ყურებისთვის
- Slack-ის დახურული ჩანელი - მხოლოდ კურსის მონაწილეებისთვის, სადაც ერთნაირი მაინდსეტის ადამიანები იკრიბებიან
- 1:1 შეხვედრები - კურსის მანძილზე შეგიძლიათ ჩაინიშნოთ 1:1 შეხვედრა C-Level-ის წარმომადგენელთან და მიიღოთ რჩევები სამსახურეობრივ საკითხებზე 
- Job Hunting პლატფორმაზე წვდომა - მარტივად ფილტრავს მსოფლიო ჯობებს, სადაც სამუშაო ვიზას არ ითხოვენ, პლუს მრავალი სხვა ბენეფიტი

კურსის სრული ღირებულებაა 2700 ლარი, ხოლო Devtherapy ს მაყურებელს 15% იანი ფასდაკლება ექნება შემდეგი პრომო კოდით

პრომო კოდი: devtherapy

🙏 შეგახსენებთ, ასევე რომ ჩვენი სპონსორია Techzy : https://www.techzy.app/

💬 შემოგვიერთდით ჩვენს Discord სერვერზე, უკვე 850+ ვართ 🚀
https://discord.com/invite/devtherapy

ასევე შეგახსენებთ, რომ ჩვენი პარტნიორია DataFest Tbilisi 2025, ფესტივალი, რომელიც იმ ადამიანებისთვისაა განკუთვნილი ვისაც აინტერესებს Data-სთან და მონაცემთა ანალიზთან ასოცირებული საკითხები. ფესტივალი ჩატარდება 27-29 ნოემბერს. Devtherapy-სთან თანამშრომლობიდან გამომდინარე, გთავაზობთ ფასდაკლების კოდს. გელით 27-29 ნოემბერს დატაფესტზე.

🎉 DataFest Tbilisi 2025 - https://www.datafest.ge/tickets/

🎉 20% ფასდაკლების Promo Code : DevTherapy2025

🎧 მოუსმინე და გამოიწერე ჩვენი პოდკასტი, შენს საყვარელ პლატფორმაზე 🎉
Buzzsprout 🎤 - https://tinyurl.com/devtherapy-buzzsrpout
AppleMusic 🎤 - https://tinyurl.com/devtherapy-applemusic
Spotify 🎤 - https://tinyurl.com/devtherapy-spotify
AmazonMusic 🎤 - https://tinyurl.com/devtherapy-amazon
Pocketcast 🎤 - https://tinyurl.com/devtherapy-pocketcast
Deezer 🎤 - https://tinyurl.com/devtherapy-deezer

📱 გვიპოვეთ სოც.ქსელებში:
Facebook: https://www.facebook.com/devtherapy
Instagram: https://www.instagram.com/_devtherapy/
TikTok: https://www.tiktok.com/@devtherapy.podcast
Linkedin: https://www.linkedin.com/company/devtherapy

https://www.linkedin.com/in/tornikegomareli/
https://www.linkedin.com/in/avtuney/

X: https://x.com/tornikegomareli
https://x.com/AVTUNEY_

Github: https://github.com/tornikegomareli

0:00 – 2:09 შესავალი, სპონსორები.
2:09 – 8:14 დასაწყისი: ბავშვობა შუქის დეფიციტი, ინვერტორის აწყობა, ელექტრონიკის აღმოჩენა, რადიომოყვარულობა, პირველი კომპიუტერი და dial-up ინტერნეტი.
8:14 – 16:11 თვითსწავლება და ექსპერიმენტები: IRC/TCL ბოტები და ავტომატიზაციის პირველი გამოცდილება.
16:11 – 29:18 პირველი სამუშაოები, შემდეგ გადასვლა Ops/Cloud მიმართულებით. ახსნა — DevOps, SRE და Platform Engineering შორის განსხვავებები. IaC-ის მიზანი და კონტეინერიზაციის არსი.
29:23 – 33:11 Scaling საფუძვლები: ვერტიკალური და ჰორიზონტალური მიდგომები.
33:11 – 35:15 VM-ები და კონტეინერები: Kubernetes და pods, Sidecar, Monitoring
35:15 – 39:41 Kubernetes-ის მუშაობა: კლასტერი, ნოდები, რეგიონული განაწილება, 
39:41 – 43:54 „ქვები vs სილა". ახალი ნოდების დამატება და capacity planning-ის მნიშვნელობა.
43:54 – 49:23 ფასები და კონტროლი: Billing ლიმიტების აუცილებლობა დამწყებებისთვის; FinOps ჰიგიენა (თეგები, ალერტები, ხარჯების კონტროლი); IaC-ის უპირატესობა ClickOps-თან შედარებით; ინფრასტრუქტურის აღწერა Terraform/Bicep-ით.
49:23 – 1:00:03 მიგრაციები და ვენდორები: Lift-and-Shift vs Replatform/Refactor მიდგომები; Managed სერვისების გადატანის სირთულე სხვა ქლაუდში; სერვერლეს არქიტექტურის პლიუსები და ღირებულება; AWS vs Azure
1:00:08 – 1:06:12 ქლაუდის ფასები პრაქტიკაში: ფასზე შეთანხმება, კრედიტები, Storage Tiers
1:06:12 – 1:12:10 ინფრასტრუქტურის საფუძვლები დეველოპერებისთვის: „სად ეშვება კოდი", VPC, Load Balancer-ის პრინციპები, CI/CD და სისტემის lifecycle-ის გაგება; T-ფორმის ცოდნის მნიშვნელობა.
1:12:10 – 1:17:33 ჰაირინგის პროცესი: HR-ის საწყისი ფილტრი vs მენეჯერის ინტერვიუ;
1:17:33 – 1:41:19 მენეჯმენტის ფილოსოფია: ტექნიკური მენეჯერის როლი; რეტროსპექტივის კულტურა;
1:41:19 – 1:54:56 ჰობი და ჰომლაბი: სოფლად ცხოვრება, ინტერნეტის რედუნდანტობა (ოპტიკა, LTE, Starlink); საშინაო სერვისები (NAS, Jellyfin); ხის და მეტალის სამუშაოები, შედუღება როგორც „თერაპია" და პროცესის ოპტიმიზაცია.
1:54:56 – 2:11:38 რჩევები, დაელაპარაკეთ მშობლებს.`,
  quizzes: [],
};
