import gamejam_2025_tsu from '@/assets/events/gamejam_2025_tsu.png';
import { Event } from './events.types';

export const eventsData: Event[] = [
  {
    id: 'gamejam-2025-tsu',
    title: 'Game Jam 2025',
    shortDescription: 'შემოგვიერთდი 48-საათიან Game Jam ში',
    fullDescription: `სიხარულით მინდა გაცნობოთ, რომ Devtherapy ატარებს პირველ ოფიციალურ 48-საათიან Game Jam-ს 🎮, რომელიც გაიმართება ივანე ჯავახიშვილის სახელობის თბილისის სახელმწიფო უნივერსიტეტში (TSU), 5-6 ივლისს 📅.

Game Jam-ის საპრიზო ფონდის ნაწილი უკვე დაფარულია ორგანიზატორებისა და Devtherapy-ის გუნდის მიერ, ხოლო დანარჩენი ნაწილი შედგება სრულად community-სგან შემოსული crowdfunding-ის საშუალებით 💸. ჩვენთვის მნიშვნელოვანია, რომ ეს ღონისძიება იყოს community-ის მიერ წახალისებული და მათზე ორიენტირებული (“From community, to community”) 🤝, რაც კიდევ უფრო გაზრდის მოტივაციას დამწყები დეველოპერების, დიზაინერების, არტისტებისა და ზოგადად ყველა იმ ადამიანისათვის, ვინც ახლა აპირებს პირველ ნაბიჯების გადადგმას 🚀.

გამომდინარე დინამიური crowdfunding პროცესიდან, საპრიზო ფონდი მზარდია და ყოველდღე იზრდება, 5-6 ივლისისთვის ზუსტად გვეცოდინება მთლიანი prize pool ი. ამასთან, ღია ვართ პარტნიორობისა და თანამშრომლობისთვის ნებისმიერი სახის სპონსორებთან 🤗.

Game Jam-ის ფარგლებში მონაწილეებს 48 საათის განმავლობაში მოუწევთ თამაშების შექმნა კონკრეტული იდეის ან მექანიკის ირგვლივ, რომელიც სპეციალური თემის სახით, ღონისძიების დაწყებისას გახდება ცნობილი 🕹️. ამ მიდგომით ვუზრუნველვყოფთ, რომ ყველა მონაწილე თანაბარ პირობებში იყოს და არ წარმოიქმნას წინასწარ მომზადებული ნამუშევრების წარდგენის შესაძლებლობა ⚖️.

გარდა ძირითადი Game Jam პროცესისა, ღონისძიების განმავლობაში დაგეგმილია სხვადასხვა Tech Talk-ები და Q&A სესიები, რომელშიც აქტიური მონაწილეობა შეგეძლებათ 🎤❓.

ღონისძიების სრული პროცესი იქნება დეტალურად გადაღებული და ასახული ვლოგის სახით Devtherapy-ის production გუნდის მიერ 🎥.

მონაწილეთა რაოდენობა შეზღუდულია და ჯამში 100 ადამიანს მოიცავს, გუნდში მონაწილეთა მაქსიმალური რაოდენობა კი 5 ადამიანია 👥.

თუ ჯერ არ გყავთ გუნდი, Game Jam-ის დაწყებისას აუცილებლად შეგვიძლია დაგეხმაროთ გუნდის მოძიებაში და შექმნაში 🛠️.

რადგან მონაწილეთა რაოდენობა შეზღუდულია, გთხოვთ, დროულად გაიაროთ რეგისტრაცია ⏳.

🔗 დარეგისტრირდი აქ 👉 https://lu.ma/rodmrn6z

ღონისძიების შესახებ სრულ ინფორმაციას და Agenda-ს მიიღებთ მეილის სახით 📧.

თუ სურვილი გაქვთ ჩაერთოთ ღონისძიების საპრიზო ფონდის გაზრდაში, შეგიძლიათ ფინანსური მხარდაჭერა გაუწიოთ Game Jam-ს შემდეგი რეკვიზიტებით:

🏦 მიმღები: Tornike Gomareli
💳 ანგარიში: GE63BG0000000609279471
📌 დანიშნულება: “Devtherapy Game Jam 2025”

ვფიქრობ, ძალიან საინტერესო და გასართობი 2 დღე გველოდება წინ!! 🎉
`,
    date: '2025-07-05T10:00:00Z',
    location: 'TSU-ს მე-11 კორპუსი (განივი)',
    type: 'Game Jam',
    image: gamejam_2025_tsu,
    featured: true,
    links: {
      rsvp: 'https://lu.ma/rodmrn6z',
    },
  },
];
